"""
20.0 数据结构（Data Structure)

20.0.1 数据结构基础
·数据结构是指相互之间存在着一种或多种关系的数据元素的合集和该合集中数据元素之间的关系组成
·简单来说，数据结构就是设计数据以何种方式组织并存储在计算机中
·列表、集合、字典等都是一种数据结构
·程序=数据结构+算法
-------------------------------------------------------------------------------
20.0.2 数据结构的分类

·数据结构按照其逻辑结构可分为线性结构、树结构、图结构
    线性结构：数据结构中的元素存在一对一的相互关系
    树结构：据结构中的元素存在一对多的相互关系
    图结构：据结构中的元素存在多对多的相互关系

===============================================================================
===============================================================================
"""


